Repository: Mejans/PinApp
Catalog: po/*.po
Languages: es

source: Create and edit application shortcuts
es: Cree y edite accesos directos de aplicaciones

source: GNOME;GTK;Apps;Shortcuts;Icons;
es: GNOME;GTK;Applicaciones;Atajos;Accesos;Directos;Iconos;

source: PinApp is a simple application that lets you customize your app list.
es: PinApp es una sencilla aplicación que le permite personalizar su lista de aplicaciones.

source: Some of the possible uses are
es: Algunos de los posibles usos son

source: Changing an app icon that doesn't fit in with your theme
es: Cambiar el icono de una aplicación que no encaja con su tema

source: Creating custom shortcuts to websites
es: Crear accesos directos personalizados a sitios web

source: Hiding apps you don't want to see
es: Ocultar aplicaciones que no quiera ver

source: Editing properties in .desktop files
es: Edición de propiedades en archivos .desktop

source: The app is made with Libadwaita and GTK4, with consideration for small-screen devices
es: La aplicación está hecha con Libadwaita y GTK4, teniendo en cuenta los dispositivos de pantalla pequeña.

source: What's changed
es: Cambios

source: Implemented autosave
es: Autoguardado implementado

source: UI overhaul with new libadwaita 1.4 widgets
es: Revisión de la interfaz de usuario con nuevos widgets libadwaita 1.4

source: Simplified creation of new files
es: Creación simplificada de archivos nuevos

source: Added ability to rename and duplicate pinned files
es: Se ha añadido la posibilidad de renombrar y duplicar archivos anclados.

source: Snap apps are now supported
es: Las aplicaciones Snap ya son compatibles

source: Added german translation thanks to @gregorni
es: Añadida traducción al alemán gracias a @gregorni

source: Added spanish translation thanks to @josushu0
es: Añadida traducción al español gracias a @josushu0

source: Improved russian translation thanks to @daudix-UFO and @fsobolev
es: Traducción al ruso mejorada gracias a @daudix-UFO y @fsobolev

source: Improvements to better comply with GNOME design guidelines thanks to @TheEvilSkeleton and @daudix-UFO
es: Mejoras para cumplir mejor con las directrices de diseño de GNOME gracias a @TheEvilSkeleton y @daudix-UFO

source: Fixes
es: Correcciones

source: Localization was prone to errors with mixed locales. Fixed thanks to @fsobolev
es: La traducción era propensa a errores con configuraciones regionales mixtas. Corregido gracias a @fsobolev

source: Using Ctrl+F to enter search always cleared the search entry and was generally unreliable
es: El uso de Ctrl+F para introducir la búsqueda siempre borraba la entrada de búsqueda y, en general, no era fiable

source: Wording of unpin dialog was unclear
es: La redacción del diálogo para desanclar no era clara

source: On Silverblue icons disappeared on reboot. Fixed by copying icons to app directory, as suggested by @thatLeaflet.
es: En Silverblue los iconos desaparecían al reiniciar. Solucionado copiando los iconos al directorio de aplicaciones, como sugiere @thatLeaflet.

source: Added russian translation thanks to @fsobolev
es: Añadida traducción al ruso gracias a @fsobolev

source: Added a keyboard shortcut to open search (Ctrl + F)
es: Añadido un atajo de teclado para abrir la búsqueda (Ctrl + F)

source: Various minor improvements in search behaviour
es: Varias mejoras menores en el comportamiento de búsqueda

source: App got stuck loading when trying to open files with duplicate keys or other syntax errors
es: La aplicación se bloqueaba al intentar abrir archivos con claves duplicadas u otros errores de sintaxis

source: Other
es: Otros

source: Added .json manifest to the project @fsobolev
es: Añadido manifiesto .json al proyecto @fsobolev

source: Added functionality to search for apps by file content
es: Se ha añadido la posibilidad de buscar aplicaciones por el contenido de los archivos

source: Added french translation thanks to Irénée Thirion
es: Añadida traducción al francés gracias a Irénée Thirion

source: Added turkish translation thanks to Sabri Ünal
es: Añadida traducción al turco gracias a Sabri Ünal

source: Reloading apps always shows "Your pins"
es: Recargar aplicaciones siempre muestra "Sus pins"

source: Added translation template
es: Añadida plantilla de traducción

source: Localized rows use the current locale by default
es: Las filas traducidas usan la configuración regional predeterminada actual.

source: Added italian translation
es: Añadida traducción al italiano

source: Not all system apps were loaded, fixed by accessing them trough the host filesystem path
es: No se cargaban todas las aplicaciones del sistema, lo que se solucionaba accediendo a ellas a través de la ruta del sistema de archivos anfitrión

source: Applications were not completely sorted alphabetically
es: Las aplicaciones no estaban completamente ordenadas alfabéticamente

source: More consinstent app icon behaviour for non-existing paths or names
es: Comportamiento más coherente de los iconos de aplicaciones para rutas o nombres inexistentes

source: Improved application banner styling with custom CSS
es: Mejora del estilo del banner de la aplicación con CSS personalizado

source: Previous release broke file saving in some occasions, now fixed
es: La versión anterior rompía el guardado de archivos en algunas ocasiones, ahora solucionado

source: Changed appearance of missing icon to match system app list
es: Se ha cambiado el aspecto del icono que faltaba para que coincida con la lista de aplicaciones del sistema

source: Added adaptive and mobile-friendly version of file view
es: Se ha añadido una versión adaptable y adaptada a dispositivos móviles de la vista de archivos

source: Added button to upload an icon from a file
es: Se ha añadido un botón para cargar un icono desde un archivo

source: Empty fields are now correctly updated and written to file
es: Los campos vacíos ahora se actualizan correctamente y se escriben en el archivo

source: Special xml charachters are now escaped in application name and comment
es: Los caracteres xml especiales ahora se escapan en el nombre de la aplicación y el comentario

source: Icons for user Flatpak applications are now visible
es: Los iconos de las aplicaciones Flatpak de los usuarios son ahora visibles

source: Better wording in various dialogs and buttons
es: Mejor redacción en varios cuadros de diálogo y botones

source: Improved file viewing ui
es: Mejora de la interfaz de visualización de archivos

source: It is now possible to add a new localized value
es: Ahora es posible añadir un valor localizado nuevo

source: Simplified display of localized values
es: Visualización simplificada de valores localizados

source: Empty values are no longer written to file after saving
es: Los valores vacíos ya no se escriben en el archivo después de guardar

source: Simplified app navigation with Adw.ViewSwitcher
es: Navegación simplificada con Adw.ViewSwitcher

source: Responsive navigation with Adw.ViewSwitcherBar
es: Navegación adaptable con Adw.ViewSwitcherBar

source: The listbox containing applications had styling issues
es: El cuadro de lista que contiene las aplicaciones tenía problemas de estilo

# shortcut window
source: Show Shortcuts
es: Mostrar atajos

# shortcut window
source: Quit
es: Salir

# shortcut window
source: Add new app
es: Añadir aplicación nueva

# shortcut window
source: Search
es: Buscar

# shortcut window
source: App editing
es: Edición de aplicaciones

# shortcut window
source: Close
es: Cerrar

source: Add new key
es: Añadir clave nueva

source: Locale
es: Configuración regional

source: Key name
es: Nombre de la clave

source: Cancel
es: Cancelar

source: Add
es: Añadir

source: Unpin this app?
es: ¿Desanclar esta aplicación?

source: If you unpin an app, your changes will be permanently lost.
es: Si desancla de una aplicación, sus cambios se perderán permanentemente.

source: Unpin
es: Desanclar

source: Save changes?
es: ¿Guardar cambios?

source: If you leave without pinning the file, your changes will be permanently lost.
es: Si abandona sin fijar el archivo, sus cambios se perderán permanentemente.

source: Discard
es: Descartar

source: Pin
es: Fijar

source: Rename file
es: Renombrar archivo

source: File name
es: Nombre del archivo

source: Rename
es: Renombrar

source: File menu
es: Menú de archivo

source: Application icon
es: Icono de la aplicación

source: Localized values
es: Valores localizados

source: String Values
es: Valores de texto

source: Boolean Values
es: Valores booleanos

source: Error opening file
es: Error al abrir el archivo

source: Add new app
es: Añadir aplicación nueva

source: Show menu
es: Mostrar menú

source: Search
es: Buscar

source: Your pins
es: Sus pins

source: Installed
es: Instaladas

source: Reload Apps
es: Recargar aplicaciones

source: Keyboard Shortcuts
es: Atajos del teclado

source: About PinApp
es: Acerca de PinApp

source: No apps found
es: No se encontraron aplicaciones

source: Applications you install will appear here
es: Las aplicaciones que instale aparecerán aquí

source: Error loading apps
es: Error al cargar aplicaciones

source: Loading apps…
es: Cargando aplicaciones…

source: No results found
es: No se encontraron resultados

source: Try searching for something else
es: Intente buscar algo más

source: No string values present
es: No hay valores de texto presentes

source: No boolean values present
es: No hay valores booleanos presentes

source: Upload icon
es: Subir ícono

source: Open
es: Abrir

source: Desktop files
es: Archivos de escritorio
